tutorials/Stefan/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    BotWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1;
        startFace       99;
    }
    FreeStream
    {
        type            patch;
        nFaces          1;
        startFace       100;
    }
    FrontNBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          200;
        startFace       101;
    }
    LeftSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       301;
    }
    RightSide
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          100;
        startFace       401;
    }
)

// ************************************************************************* //
