tutorials/Stefan/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

twoPhase
{
    transportModel  twoPhase;
    phase1          phase1;
    phase2          phase2;
}

//iso-Butane, 298K
phase1
{
    transportModel  		Newtonian;
    nu              		nu [ 0 2 -1 0 0 0 0 ] 2.74E-7;
    rho             		rho [ 1 -3 0 0 0 0 0 ] 550.6;
    thermalTransportModel	Fourier;
    lambda			lambda [1 1 -3 -1 0 0 0] 0.0892;
    cp				cp [ 0 2 -2 -1 0 0 0] 2446;
}

phase2
{
    transportModel		Newtonian;
    nu				nu [ 0 2 -1 0 0 0 0 ] 8.48E-7;
    rho				rho [ 1 -3 0 0 0 0 0 ] 9.12;
    thermalTransportModel	Fourier;
    lambda			lambda [1 1 -3 -1 0 0 0] 0.0169;
    cp				cp [ 0 2 -2 -1 0 0 0] 1819;
}

sigma           0.01;
T_0	     298;


thermalPhaseChange
{
	model       InterfaceEquilibrium;
	h_lv		h_lv  [0 2 -2 0 0 0 0 ] 329365;
	T_sat		T_sat [0 0 0 1 0 0 0] 298;
	CondThresh  0.75; //Interface threshold for condensing cell pairs
	EvapThresh  0.01; //Interface threshold for evaporating cell pairs
	RelaxFac    1.0; //No under-relaxation for now
}

surfaceTensionForce
{
	model      Brackbill;
}

// ************************************************************************* //
